Autodesk.Revit.DB.Structure.AnalyticalModelSweptProfile.GetSweptProfile
Returns an object that describes the profile that is swept along the driving curve.
Remarks:
The profile is swept perpendicular to the driving curve.
Returns:
A geometric profile object.
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModelSweptProfile.GetDrivingCurve
Provides access to the curve that dictates the path of the swept profile.
Remarks:
The profile may not be swept the entire length of this curve.  One should check the
set back properties on this object to locate how far the actual sweep is from the ends of the curve.
Returns:
A curve that defines the path of the swept profile.
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModelSweptProfile.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Structure.AnalyticalModelSweptProfile.EndSetBack
The distance from the end of the driving curve to the point where the sweep actually ends.
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModelSweptProfile.StartSetBack
The distance from the start of the driving curve to the point where the sweep actually begins.
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModelSweptProfile
Represents an extruded profile swept along a driving curve.
Remarks:
Elements such as beams may be formed from a profile that has been swept
along a curve.  This analytical model represents such a form and is used to access the
cross section and the underlying curve that make up the Element.
Since:
2011